avr-rust/avrd/packs/atmega/ATmega64RFR2.atdf
      <value-group caption="" name="ANALOG_ADC_V_REF9">
        <value caption="AREF, Internal reference voltage generation turned off" name="VAL_0x00" value="0x00"/>
        <value caption="AVDD with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
        <value caption="Internal 1.5V Voltage Reference (no external capacitor at AREF pin)" name="VAL_0x02" value="0x02"/>
        <value caption="Internal 1.6V Voltage Reference (no external capacitor at AREF pin)" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER">
        <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
        <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
        <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_TRACK_AND_HOLD_TIME">
        <value caption="Single ended: 1, differential 3 ADC clock cycles" name="VAL_0x00" value="0x00"/>
        <value caption="Single ended: 2, differential 5 ADC clock cycles" name="VAL_0x01" value="0x01"/>
        <value caption="Single ended: 3, differential 7 ADC clock cycles" name="VAL_0x02" value="0x02"/>
        <value caption="Single ended: 4, differential 9 ADC clock cycles" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_STARTUP_TIME">
        <value caption="3 ADC clock cycles" name="VAL_0x00" value="0x00"/>
        <value caption="7 ADC clock cycles" name="VAL_0x01" value="0x01"/>
        <value caption="11 ADC clock cycles" name="VAL_0x02" value="0x02"/>
        <value caption="15 ADC clock cycles" name="VAL_0x03" value="0x03"/>
        <value caption="..." name="VAL_0x04" value="0x04"/>
        <value caption="251 ADC clock cycles" name="VAL_0x3E" value="0x3E"/>
        <value caption="255 ADC clock cycles" name="VAL_0x3F" value="0x3F"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
          <bitfield caption="Read While Write Section Read Enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
          <bitfield caption="Pull-up Disable" mask="0x10" name="PUD"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on Reset Flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1">
          <bitfield caption="Oscillator Calibration Tuning Value" mask="0xFF" name="CAL" values="OSCCAL_BITF"/>
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1">
          <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
          <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL_MEGARF"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x4B" size="1">
          <bitfield caption="General Purpose I/O Register 2 Value" mask="0xFF" name="GPIOR" lsb="20"/>
        </register>
